export const API_URL = "https://heimu69.pythonanywhere.com/";

export const endpoints = {
  TOKEN: "api/v1/token/",
  TOKEN_REFRESH: "api/v1/token/refresh/",
  TOKEN_VERIFY: "api/v1/token/verify/",
  CANDIDATES: "api/v1/candidates/",
  UPLOAD_CERTIFICATE: "api/v1/upload-certificate/",
  NOMINATIONS: "api/v1/nominations/",
  VOTES: "api/v1/votes/",
};

export const resourcesTranslate = {
  kz: {
    translation: {
      Логин: "Логин",
      "Номер телефона": "Телефон номері",
      Пароль: "Құпия сөз",
      "Копия удостоверения журналиста": "Журналистің жеке куәлігінің көшірмесі",
      "Загрузить файлы": "Файлдарды жүктеу",
      ВОЙТИ: "КІРУ",
      "Нажимая на кнопку, вы даете согласие на сбор и обработку ваших персональных данных":
        "Батырманы басу арқылы сіз өзіңіздің жеке деректеріңізді жинауға және өңдеуге келісім бересіз",
      "За верность профессии": "Мамандыққа адалдығы үшін",
      "За активную жизненную позицию": "Белсенді өмірлік ұстанымы үшін",
      "Мастер объектива": "Обьектив шебері",
      "Лучшее освещение сельской тематики":
        "Ауыл тақырыбындағы үздік жарияланым",
      "Лучшее освещение социальной тематики":
        "Әлеуметтік тақырыптағы үздік жарияланым",
      "Лучшее освещение производственной тематики":
        "Өндіріс тақырыбындағы  үздік жарияланым",
      "За первые успехи": "Алғашқы табыстары үшін",
      "Лучшая творческая работа года": "Жылдың үздік шығармашылық жұмысы",
      "За стиль и функциональность": "Мәнері мен атқарымдылығы үшін",
      "За лучшее освещение актуальных проблем в социальных сетях":
        "Әлеуметтік желілердегі өзекті мәселелерді үздік жариялағаны үшін",
      Русский: "Орыс",
      Казахский: "Қазақ",
      Проголосовать: "Дауыс беру",
    },
  },
};
